cases/square_Re150/grad_amr/system/gradUDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      gradUDict;
}

functions
{
    gradU
    {
        type            grad;
        libs            (fieldFunctionObjects);
        field           U;
        result          gradU;
    }

    magGradU
    {
        type            mag;
        libs            (fieldFunctionObjects);
        field           gradU;
        result          magGradU;
    }
}
